# language: ja
機能: クライアントコンフィグレータが Lucie クライアントを初期化する

  クライアントコンフィグレータは
  設定リポジトリを各 Lucie ノードに配置するために
  Lucie クライアント上に必要な環境の初期化をしたい

  背景:
    前提 クライアントコンフィグレータ

  シナリオ: config ディレクトリの生成
    前提 config ディレクトリが Lucie クライアント上に存在しない
    もし クライアントコンフィグレータが Lucie クライアント (IP アドレスは "192.168.0.1") を初期化した
    ならば config ディレクトリが Lucie クライアント上に生成される

  シナリオ: config ディレクトリの生成をスキップ
    前提 config ディレクトリが Lucie クライアント上にすでに存在
    もし クライアントコンフィグレータが Lucie クライアント (IP アドレスは "192.168.0.1") を初期化した
    ならば config ディレクトリが Lucie クライアント上に生成されない

  シナリオ: bin ディレクトリの生成
    前提 bin ディレクトリが Lucie クライアント上に存在しない
    もし クライアントコンフィグレータが Lucie クライアント (IP アドレスは "192.168.0.1") を初期化した
    ならば bin ディレクトリが Lucie クライアント上に生成される

  シナリオ: bin ディレクトリの生成をスキップ
    前提 bin ディレクトリが Lucie クライアント上にすでに存在
    もし クライアントコンフィグレータが Lucie クライアント (IP アドレスは "192.168.0.1") を初期化した
    ならば bin ディレクトリが Lucie クライアント上に生成されない
