# language: ja
機能: クライアントコンフィグレータが Lucie クライアントを初期化する

  クライアントコンフィグレータは
  設定リポジトリを各 Lucie ノードに配置するために
  Lucie クライアント上に必要な環境の初期化をしたい

  背景:
    前提 Lucie サーバ上に Mercurial で管理された設定リポジトリ (ssh://myrepos.org//lucie) の複製が存在
    かつ クライアントコンフィグレータ

  シナリオ: config ディレクトリの生成
    前提 config ディレクトリが Lucie クライアント上に存在しない
    もし クライアントコンフィグレータがその設定リポジトリを Lucie クライアント (IP アドレスは "192.168.0.100") へ配置した
    ならば config ディレクトリが Lucie クライアント上に生成される

  シナリオ: config ディレクトリの生成をスキップ
    前提 config ディレクトリが Lucie クライアント上にすでに存在
    もし クライアントコンフィグレータがその設定リポジトリを Lucie クライアント (IP アドレスは "192.168.0.100") へ配置した
    ならば config ディレクトリが Lucie クライアント上に生成されない

  シナリオ: bin ディレクトリの生成をスキップ
    前提 bin ディレクトリが Lucie クライアント上にすでに存在
    もし クライアントコンフィグレータがその設定リポジトリを Lucie クライアント (IP アドレスは "192.168.0.100") へ配置した
    ならば bin ディレクトリが Lucie クライアント上に生成されない
