# language: ja
機能: コンフィグレーションアップデータが Lucie クライアント上の設定リポジトリを更新する

  コンフィグレーションアップデータは
  クライアントの設定を更新するために
  クライアント上の設定リポジトリを更新する

  シナリオ: クライアント上の設定リポジトリを更新
    前提 Lucie クライアント "yasuhito_node" 用の設定リポジトリ (Mercurial)
      かつ コンフィグレータがその設定リポジトリを Lucie サーバに複製
      かつ コンフィグレータがその設定リポジトリを Lucie サーバ上でローカルに複製
      かつ コンフィグレータがその設定リポジトリを Lucie クライアント "yasuhito_node" に複製
      かつ Mercurial が Lucie クライアントにインストールされている
    もし コンフィグレーションアップデータが Lucie クライアント "yasuhito_node" の更新を実行
    ならば Lucie クライアント上のそのリポジトリが "hg pull" コマンドで更新される
      かつ Lucie クライアント上のそのリポジトリが "hg update" コマンドで更新される
