# language: ja
機能: コンフィグレーションアップデータが Lucie クライアント上の設定リポジトリを更新する

  コンフィグレーションアップデータは
  クライアントの設定を更新するために
  クライアント上の設定リポジトリを更新する

  シナリオ: クライアント上の設定リポジトリを更新 (Mercurial)
    前提 Lucie クライアント "yasuhito_node" 用の設定リポジトリ (Mercurial)
      かつ コンフィグレータがその設定リポジトリを Lucie サーバに複製
      かつ コンフィグレータがその設定リポジトリを Lucie サーバ上でローカルに複製
      かつ コンフィグレータがその設定リポジトリを Lucie クライアント "yasuhito_node" に複製
      かつ Mercurial が Lucie クライアントにインストールされている
    もし コンフィグレーションアップデータが Lucie クライアント "yasuhito_node" の更新を実行
    ならば Lucie クライアント上のそのリポジトリが "hg pull" コマンドで更新される
      かつ Lucie クライアント上のそのリポジトリが "hg update" コマンドで更新される

  シナリオ: クライアント上の設定リポジトリを更新 (Subversion)
    前提 Lucie クライアント "yasuhito_node" 用の設定リポジトリ (Subversion)
      かつ コンフィグレータがその設定リポジトリを Lucie サーバに複製
      かつ コンフィグレータがその設定リポジトリを Lucie クライアント "yasuhito_node" に複製
      かつ Subversion が Lucie クライアントにインストールされている
    もし コンフィグレーションアップデータが Lucie クライアント "yasuhito_node" の更新を実行
    ならば Lucie クライアント上のそのリポジトリが "scp" コマンドで更新される

  # [TODO] Git のテスト
  # シナリオ: クライアント上の設定リポジトリを更新 (Git)
  #   前提 Lucie クライアント "yasuhito_node" 用の設定リポジトリ (Git)
  #     かつ コンフィグレータがその設定リポジトリを Lucie サーバに複製
  #     かつ コンフィグレータがその設定リポジトリを Lucie クライアント "yasuhito_node" に複製
  #     かつ Git が Lucie クライアントにインストールされている
  #   もし コンフィグレーションアップデータが Lucie クライアント "yasuhito_node" の更新を実行
  #   ならば Lucie クライアント上のそのリポジトリが "git pull" コマンドで更新される
  #     かつ Lucie クライアント上のそのリポジトリが "git update" コマンドで更新される
