# language: ja
機能: LDB がクライアント設定を更新する

  LDB は
  クライアント設定を更新するために
  サーバとクライアントのリポジトリを更新した後 LDB を実行する

  背景:
    前提 ドライランモードがオン
    かつ 冗長モードがオン

  シナリオ: 設定の更新
    前提 Lucie クライアント "yasuhito_node"
    かつ バックエンドとして mercurial を指定したコンフィグレータ
    かつ コンフィグレータが Lucie サーバに設定リポジトリ "http://myrepos.org/myconfig" を複製
    かつ コンフィグレータがその設定リポジトリを Lucie クライアント "yasuhito_node" へ配置した
    もし LDB がクライアント "yasuhito_node" の更新を実行した
    ならば Lucie サーバの設定リポジトリが更新され
    かつ Lucie サーバの設定リポジトリ複製が更新され
    かつ ノードの設定リポジトリが更新され
    かつ LDB が実行される

